# Цикл for

# for i in 2, 3, 5:
#     print(i * i)



# for i in range(10):
#     print(i * i)



# Вывести квадрат из звездочек

# n = int(input())
# for i in range(n):
#     print('*' * n)


# n = int(input())
# for i in range(n):
#     for j in range(n):
#         print('*', end='')
#     print()

# Когда Павел учился в школе, он запоминал таблицу умножения прямоугольными блоками. 
# Для тренировок ему бы очень пригодилась программа, которая показывала бы блок таблицы умножения.

# Напишите программу, на вход которой даются четыре числа aa, bb, cc и dd, каждое в своей строке.
# Программа должна вывести фрагмент таблицы умножения для всех чисел отрезка [a; b][a;b] на все числа отрезка [c;d][c;d].

# Числа aa, bb, cc и dd являются натуральными и не превосходят 10, a \le ba≤b, c \le dc≤d.

# Следуйте формату вывода из примера, для разделения элементов внутри строки используйте '\t' — символ табуляции. 
# Заметьте, что левым столбцом и верхней строкой выводятся сами числа из заданных отрезков — заголовочные столбец и строка таблицы.

a, b, c, d = int(input()), int(input()), int(input()), int(input())

for i in range(c, d + 1):
    print("\t" + str(i), end="")

print()

for i in range(a, b + 1):
    print(i, end="\t")
    for n in range(c, d + 1):
        print(i * n, end="\t")
    print()